Repository: FIUS/MS365-Accountcreator
Catalog: ms365_accountcreator/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Email illegal
de: Diese Email Addresse folgt nicht dem notwendigen Format

source: Email already used
de: Diese Email Addresse wurde bereits benutzt um einen Account zu erstellen

source: Upstream API error
de: Fehler einer weiter hinten liegenden API

source: registration mail subject
de: Willkommen

source: registration mail body with %(username)s and %(password)s
de: Hallo, deine Registration war erfolgreich. Du kannst dich jetzt mit deinem Nutzer %(username)s und deinem Passwort %(password)s unter <a href='htttps://teams.microsoft.com'>teams.microsoft.com</a> einloggen. Grüße Die Admins

source: Account Registration for Microsoft Teams for University of Stuttgart
de: Account Registrierung für Microsoft Teams an der Universität Stuttgart

source: Internet Explorer is NOT supported!
de: Der Internet Explorer wird NICHT unterstützt!

source: Please use a recent Firefox, Chrome, Edge or Safari browser to access this site!
de: Bitte nutze einen aktuellen Firefox, Chrome, Edge oder Safari Browser um dise Seite zu verwenden!

source: Step 0
de: Einführung

source: Explanation and statement containing %(support)s
de: Dieses Jahr benutzt der Fachbereich Informatik Microsoft Teams um die Online Lehre zu verbessern. Für das beste Ergebnis, ist es sinvoll, dass Studierende einen Microsoft Account in der Struktur des Fachbereichs haben. Um das zu erleichtern haben wir dieses kleine Tool entwickelt, welches automatisch solche Accounts für unsere Microsoft 365 Edu-A1 Lizenz erzeugt. Wenn du Fragen hast wende dich bitte an <a href=mailto:%(support)s>%(support)s</a>. Um die unten erteilte Zustimmung zur Verarbeitung von Daten zu widerrufen wende dich bitte auch an diese Addresse.

source: Step 1
de: Schritt 1

source: Your st****** email address
de: Deine st****** E-Mail Adresse

source: You must use your st******@stud.uni-stuttgart.de email in this field.
de: Du musst deine st******@stud.uni-stuttgart.de E-Mail Adresse in diesem Feld eintragen.

source: I consent that my st****** email is saved to prevent duplicate Account creation.
de: Ich stimme zu, dass meine eingegebene st****** E-Mail Adresse verarbeitet und gespeichert wird um das generierte Passwort zu verschicken und um sicherzustellen, dass maximal ein Account pro Student*in angelegt wird. Mir ist bewusst, dass ich diese Zustimmung widerrufen und die Löschung der Daten veranlassen kann (über die oben genannte Support Email Addresse).

source: Detailed legal text email
de: Die Email Addresse wird auf Servern Fachbereichs und/oder der Fachgruppe Informatik verarbeitet und gespeichert. Außerdem wird eine E-Mail an die angegebene Addresse geschickt. Die Email Addresse wird nicht an Microsoft übertragen.

source: Next
de: Weiter

source: Step 2
de: Schritt 2

source: I consent that my Name is used to create an Account for Microsoft Teams.
de: Ich stimme zu, dass mein eingegebener vollständiger Name benutzt wird um einen Account für Microsoft Teams zu erstellen und dazu an Microsoft übertragen wird um dort verarbeitet und gespeichert zu werden. Mir ist bewusst, dass ich diese Zustimmung widerrufen und die Löschung der Daten veranlassen kann (über die oben genannte Support Email Addresse).

source: Detailed legal text teams
de: Der Name wird einmalig auf Servern Fachbereichs und/oder der Fachgruppe Informatik verarbeitet und dann direkt an die Server von Microsoft gesendet. Microsoft speichert und verarbeitet diese Daten und alle Daten die im Zusammenhang mit dem Account anfallen mindestens bis zur Löschung des Accounts. Weitere Informationen können https://privacy.microsoft.com/de-de/privacystatement entnommen werden.

source: Step 3
de: Schritt 3

source: Name
de: Vorname

source: Family Name
de: Nachname

source: Create Account
de: Account erstellen

source: Result
de: Ergebnis

source: Awaiting API response:
de: Warte auf Antwort der API

source: There was an error while connecting to the server. Please try again later or contact the administrator of this site.
de: Es gab einen Error beim Verbinden mit dem Server. Bitte versuche es später erneut oder kontaktiere den Support.

source: Your account was successfully created and an email with the password will be sent to your specified st****** email.
de: Dein Account wurde erfolgreich erstellt. Eine E-Mail mit den Accountdaten wird an die angegebene st****** E-Mal gesendet.

source: There was an error creating your account. Please try again later or contact the administrator of this site.
de: Es gab einen Fehler beim Erstellen des Accounts. Bitte versuche es später nochmal oder kontaktiere den Support.
